# Data cleaning
importer pandas et le dataset

In [1]:
import pandas as pd

In [18]:
chemin = "Https://bit.ly/world-cities-clean"
data = pd.read_csv(chemin)

In [13]:
data.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

les raccourcis clavier
sur les cellules :
m pour transformer en markdown
y pour du code
r pour du raw (code non executable)
a creer une cellule au dessus
b creer une cellule en dessous
dd supprimer la cellule

## exo 1 les lectures de csv qui n'existent pas

In [ ]:
chemin1 = "./oui"
data1 = pd.read_csv(chemin1)

FileNotFoundError: [Errno 2] No such file or directory: '.\\oui'

le dossier ou fichier n'a pas ete trouve

il faut mettre un chemin valide qui mene a un fichier existant

## exo2 on a perdu la tete

In [42]:
chemin2 = "Https://bit.ly/world-cities-dirty-v1"
data2 = pd.read_csv(chemin2)

In [43]:
data2.head()

       les Escaldes               Andorra Escaldes-Engordany  3040051
0  Andorra la Vella               Andorra   Andorra la Vella  3041563
1    Umm al Qaywayn  United Arab Emirates     Umm al Qaywayn   290594
2    Ras al-Khaimah  United Arab Emirates    Raʼs al Khaymah   291074
3      Khawr Fakkān  United Arab Emirates       Ash Shāriqah   291696
4             Dubai  United Arab Emirates              Dubai   292223

le nom des colonne est incorrect mais il n'y a pas de message d'erreur

In [70]:
data2 = pd.read_csv(chemin2,names=['name','country','subcountry','geonameid'])

In [71]:
data2.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

## exo 3 lorem ipsum (ad lib)

In [64]:
chemin3 = "Https://bit.ly/world-cities-dirty-v2"
data3 = pd.read_csv(chemin3)
data3

,,,,,,Lorem ipsum dolor sit amet,consectetur adipiscing elit,sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident,sunt in culpa qui officia deserunt mollit anim id est laborum.
Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium,totam rem aperiam,eaque ipsa quae ab illo inventore veritatis et quasi architecto beatae vitae dicta sunt explicabo. Nemo enim ipsam voluptatem quia voluptas sit aspernatur aut odit aut fugit,sed quia consequuntur magni dolores eos qui ratione voluptatem sequi nesciunt. Neque porro quisquam est,qui dolorem ipsum quia dolor sit amet,consectetur,adipisci velit,sed quia non numquam eius modi tempora incidu...,quis nostrum exercitationem ullam corporis su...,nisi ut aliquid ex ea commodi consequatur? Qu...,vel illum qui dolorem eum fugiat quo voluptas...
name,country,subcountry,geonameid,NaN,NaN,NaN,NaN,NaN,NaN,NaN
les Escaldes,Andorra,Escaldes-Engordany,3040051,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Andorra la Vella,Andorra,Andorra la Vella,3041563,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Umm al Qaywayn,United Arab Emirates,Umm al Qaywayn,290594,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
Bindura,Zimbabwe,Mashonaland Central,895061,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Beitbridge,Zimbabwe,Matabeleland South,895269,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Epworth,Zimbabwe,Harare,1085510,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Chitungwiza,Zimbabwe,Harare,1106542,NaN,NaN,NaN,NaN,NaN,NaN,NaN
At vero eos et accusamus et iusto odio dignissimos ducimus qui blanditiis praesentium voluptatum deleniti atque corrupti quos dolores et quas molestias excepturi sint occaecati cupiditate non provident,similique sunt in culpa qui officia deserunt mollitia animi,id est laborum et dolorum fuga. Et harum quidem rerum facilis est et expedita distinctio. Nam libero tempore,cum soluta nobis est eligendi optio cumque nihil impedit quo minus id quod maxime placeat facere possimus,omnis voluptas assumenda est,omnis dolor repellendus. Temporibus autem quibusdam et aut officiis debitis aut rerum necessitatibus saepe eveniet ut et voluptates repudiandae sint et molestiae non recusandae. Itaque earum rerum hic tenetur a sapiente delectus,ut aut reiciendis voluptatibus maiores alias ...,NaN,NaN,NaN,NaN

on a un lorem ipsum en nom de colonnes et en premiere et derniere ligne

In [65]:
chemin3 = "Https://bit.ly/world-cities-dirty-v2"
data3 = pd.read_csv(chemin3,skiprows=2,skipfooter=1)
data3

<ipython-input-65-d838235c124e>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  data3 = pd.read_csv(chemin3,skiprows=2,skipfooter=1)

                   name               country           subcountry  geonameid
0          les Escaldes               Andorra   Escaldes-Engordany    3040051
1      Andorra la Vella               Andorra     Andorra la Vella    3041563
2        Umm al Qaywayn  United Arab Emirates       Umm al Qaywayn     290594
3        Ras al-Khaimah  United Arab Emirates      Raʼs al Khaymah     291074
4          Khawr Fakkān  United Arab Emirates         Ash Shāriqah     291696
...                 ...                   ...                  ...        ...
23013          Bulawayo              Zimbabwe             Bulawayo     894701
23014           Bindura              Zimbabwe  Mashonaland Central     895061
23015        Beitbridge              Zimbabwe   Matabeleland South     895269
23016           Epworth              Zimbabwe               Harare    1085510
23017       Chitungwiza              Zimbabwe               Harare    1106542

[23018 rows x 4 columns]

si on a un probleme d'encodage il faut rajouter ,encode='utf-8' au read csv

## exo 4 separation difficile

In [80]:
chemin4 = "Https://bit.ly/world-cities-dirty-v3"
data4 = pd.read_csv(chemin4)
data4.head()

     les Escaldes|Andorra|Escaldes-Engordany|3040051
0  Andorra la Vella|Andorra|Andorra la Vella|3041563
1  Umm al Qaywayn|United Arab Emirates|Umm al Qay...
2  Ras al-Khaimah|United Arab Emirates|Raʼs al Kh...
3  Khawr Fakkān|United Arab Emirates|Ash Shāriqah...
4            Dubai|United Arab Emirates|Dubai|292223

In [81]:
data4.tail()

      les Escaldes|Andorra|Escaldes-Engordany|3040051
23012               Bulawayo|Zimbabwe|Bulawayo|894701
23013     Bindura|Zimbabwe|Mashonaland Central|895061
23014   Beitbridge|Zimbabwe|Matabeleland South|895269
23015                 Epworth|Zimbabwe|Harare|1085510
23016             Chitungwiza|Zimbabwe|Harare|1106542

ici on a un probleme ou au lieu d'avoir des , pour delimiter on a des | et y a pas de nom de colonnes

In [76]:
chemin4 = "Https://bit.ly/world-cities-dirty-v3"
data4 = pd.read_csv(chemin4, delimiter='|',names=['name','country','subcountry','geonameid'])
data4.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

In [77]:
data4.tail()

              name   country           subcountry  geonameid
23013     Bulawayo  Zimbabwe             Bulawayo     894701
23014      Bindura  Zimbabwe  Mashonaland Central     895061
23015   Beitbridge  Zimbabwe   Matabeleland South     895269
23016      Epworth  Zimbabwe               Harare    1085510
23017  Chitungwiza  Zimbabwe               Harare    1106542

on a demande a modifier quel est le delimiteur plutot que de le remplacer pour des raisons pratiques, sinon il faudrait remodifier le fichier a chaque mise a jour de ce dernier. et on a rajoute l'en tete

## les bons conseils du professeur

apres avoir importe et stocke un csv :<br/><br/>
<strong>df.shape</strong> pour regarder le nombres de ligne et de colonnes<br/>
<strong>df.dtypes</strong> pour regarder le nom des colonnes et leur type d'un seul coup (j'en profite pour repérer d'éventuel conversion de types qu'il faudra effectuer)<br/>
<strong>df.head()</strong> pour regarder à quoi ressemble les premières lignes du dataset.<br/>
<strong>df.tail()</strong> pour regarder les dernières lignes du dataset. J'en profite pour comparer le résultat de head avec celui de tail, y-a-t'il une quelconque différence? Parfois les anomalies sont rangées à la fin du dataset.<br/>
<strong>df.isna().sum()</strong> pour vérifier la présence de valeurs manquantes par colonnes.<br/>

In [85]:
cheminex="https://bit.ly/bitcoin-data"
dataex=pd.read_csv(cheminex)

In [86]:
dataex.shape

(33, 7)

In [87]:
dataex.dtypes

Date           object
Open*         float64
High          float64
Low           float64
Close**       float64
Volume        float64
Market Cap    float64
dtype: object

In [88]:
dataex.head()

          Date    Open*     High      Low  Close**        Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  4.484178e+10  1.603195e+11
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  2.248291e+10  1.478905e+11
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  2.290344e+10  1.487530e+11
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  2.552117e+10  1.459242e+11
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  2.871458e+10  1.482499e+11

In [89]:
dataex.tail()

,Date,Open*,High,Low,Close**,Volume,Market Cap
28,Dec 17 2019,6931.32,6964.07,6587.97,6640.52,2.236380e+10,1.202342e+11
29,Dec 16 2019,7153.66,7171.17,6903.68,6932.48,2.021327e+10,1.255156e+11
30,Dec 15 2019,7124.24,7181.08,6924.38,7152.30,1.688113e+10,1.294814e+11
31,* Earliest data in range (UTC time),NaN,NaN,NaN,NaN,NaN,NaN
32,** Latest data in range (UTC time),NaN,NaN,NaN,NaN,NaN,NaN

In [90]:
dataex.isna().sum()

Date          0
Open*         2
High          2
Low           2
Close**       2
Volume        2
Market Cap    2
dtype: int64

on constate qu'il y a un probleme qu'on doit regler

In [122]:
dataex=pd.read_csv(cheminex,skipfooter=2)

<ipython-input-122-9a974c9a3621>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  dataex=pd.read_csv(cheminex,skipfooter=2)

la les tests donneront des resultats plus pertinents car probleme corrige

In [92]:
dataex.shape

(31, 7)

In [94]:
dataex.dtypes

Date           object
Open*         float64
High          float64
Low           float64
Close**       float64
Volume          int64
Market Cap      int64
dtype: object

In [95]:
dataex.head()

          Date    Open*     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [96]:
dataex.tail()

           Date    Open*     High      Low  Close**       Volume    Market Cap
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  25904604416  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  31836522778  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  20213265950  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  16881129804  129481424648

In [98]:
dataex.isna().sum()

Date          0
Open*         0
High          0
Low           0
Close**       0
Volume        0
Market Cap    0
dtype: int64

la on part sur du csv propre sur lequel on peut travailler

# alteration des tables

les vues : l'utilisation d'inplace<br/>
True on altere l'original<br/>
False on renvoie une vue/copie<br/>

In [118]:
dataex.rename(columns={"Open*":"Open"},inplace=True)

modifie l'original

dataex = dataex.rename(columns={"Open*":"Open"})

fait de meme

dataex["Open*"].rename("Open")

ne modifie pas l'original

In [119]:
dataex.head()

          Date     Open     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [120]:
dataex.drop("Open",axis='columns', inplace=True)

ici on a definitvement detruit Open et rappeler la fonction renvoierai une erreur

In [121]:
dataex.head()

          Date     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  8166.55  7726.77  8166.55  28714583844  148249907277

In [127]:
dataex.rename(str.lower, axis='columns').head()

          date    open*     high      low  close**       volume    market cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [ ]:
methode 1 pour remplacer les noms de colonnes problematiques

In [128]:
def modif(s):
    s = s.replace('*','')
    s = s.replace(' ','_')
    return s

In [146]:
dataex.rename(modif, axis='columns').head()

          Date     Open     High      Low    Close       Volume    Market_Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [131]:
dataex.columns.str.replace('*','')

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'Market Cap'], dtype='object')

In [132]:
dataex.columns.str.replace(' ','_')

Index(['Date', 'Open*', 'High', 'Low', 'Close**', 'Volume', 'Market_Cap'], dtype='object')

## mise en pratique

In [156]:
d = {'col1': [1, 2], 'col2': [3, 4]}

df = pd.DataFrame(data=d)

methode 2 : utilisation du module str

In [157]:
df.columns = df.columns.str.replace('col','in*t ')

In [158]:
df

   in*t 1  in*t 2
0       1       3
1       2       4

methode 1 : rename + mapper

In [159]:
df.rename(modif, axis='columns').head()

   int_1  int_2
0      1      3
1      2      4